uat_chat/Documents/уатПланированиеРаботыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>уатПланированиеРаботыТС</Name>
			<Comment>Планирование работы ТС</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатПланРаботыТС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Comment>Кратность документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Comment>Сценарий</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьДетализации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставПлана</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидБилета</Name>
							<Comment>Вид билета</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатВидыБилетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДетализацияПланирования</Name>
							<Comment>Детализация планирования</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТипыТС</v8:Type>
								<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Comment>Маршрут</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрВыработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МашиноДни</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

uat_chat/InformationRegisters/уатРегламентированныйПроизводственныйКалендарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>уатРегламентированныйПроизводственныйКалендарь</Name>
			<Comment>Регламентированный производственный календарь (уат)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пятидневка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Шестидневка</Name>
					<Comment>Шестидневка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КалендарныеДни</Name>
					<Comment>Календарные дни</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыДнейПроизводственногоКалендаря</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаКалендаря</Name>
					<Comment>Дата календаря</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Comment>Год</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/Documents/уатПланированиеРаботыТС/Ext/ManagerModule.bsl
// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
    мЗапрос = Новый Запрос;
	мЗапрос.Текст =
	"ВЫБРАТЬ
	|	уатПланированиеРаботыТССоставПлана.Ссылка КАК Регистратор,
	|	Календарь.ДатаКалендаря КАК Период,
	|	уатПланированиеРаботыТССоставПлана.Ссылка.Сценарий,
	|	уатПланированиеРаботыТССоставПлана.Ссылка.Подразделение,
	|	уатПланированиеРаботыТССоставПлана.ДетализацияПланирования,
	|	уатПланированиеРаботыТССоставПлана.Ссылка КАК ДокументПланирования,
	|	уатПланированиеРаботыТССоставПлана.Номенклатура,
	|	уатПланированиеРаботыТССоставПлана.ПараметрВыработки,
	|	уатПланированиеРаботыТССоставПлана.Заказ,
	|	уатПланированиеРаботыТССоставПлана.Контрагент,
	|	уатПланированиеРаботыТССоставПлана.Договор,
	|	уатПланированиеРаботыТССоставПлана.Маршрут,
	|	Выразить(уатПланированиеРаботыТССоставПлана.Количество  * CASE WHEN Календарь.Пятидневка=1 THEN &КоэфРаб / итТбл.Раб ELSE &КоэфВых / итТбл.Вых END как Число(15,3)) Количество,
	|	Выразить(уатПланированиеРаботыТССоставПлана.Сумма       * CASE WHEN Календарь.Пятидневка=1 THEN &КоэфРаб / итТбл.Раб ELSE &КоэфВых / итТбл.Вых END как Число(15,2))  КАК Стоимость,
	|	уатПланированиеРаботыТССоставПлана.СуммаНДС КАК НДС,
	|   уатПланированиеРаботыТССоставПлана.Количество итКол,
	|   уатПланированиеРаботыТССоставПлана.Сумма      итСум,
	|	уатПланированиеРаботыТССоставПлана.Приоритет,
	|	уатПланированиеРаботыТССоставПлана.ВидБилета
	|ИЗ
	|	Документ.уатПланированиеРаботыТС.СоставПлана КАК уатПланированиеРаботыТССоставПлана
	|
	|INNER JOIN (
	|			ВЫБРАТЬ
	|				SUM(уатРегламентированныйПроизводственныйКалендарь.КалендарныеДни) Дни,
	|				SUM(уатРегламентированныйПроизводственныйКалендарь.Пятидневка) Раб,
	|				SUM(уатРегламентированныйПроизводственныйКалендарь.КалендарныеДни) - SUM(уатРегламентированныйПроизводственныйКалендарь.Пятидневка) Вых
	|			ИЗ
	|				РегистрСведений.уатРегламентированныйПроизводственныйКалендарь КАК уатРегламентированныйПроизводственныйКалендарь
	|			WHERE ДатаКалендаря >= &Дт и ДатаКалендаря < &Дт1
	|           ) итТбл On истина
	|
	|INNER JOIN  РегистрСведений.уатРегламентированныйПроизводственныйКалендарь КАК Календарь ON  ДатаКалендаря >= &Дт и ДатаКалендаря < &Дт1 
	|
	|
	|
	|
	|ГДЕ
	|	уатПланированиеРаботыТССоставПлана.Ссылка = &Ссылка";
	
	

	мЗапрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	мЗапрос.УстановитьПараметр("Дт",НачалоМесяца(ДокументСсылка.Дата));
	мЗапрос.УстановитьПараметр("Дт1",КонецМесяца(ДокументСсылка.Дата)+1);
	мЗапрос.УстановитьПараметр("КоэфВых",0.17);
	мЗапрос.УстановитьПараметр("коэфРаб",0.83);
	
	мТаб = мЗапрос.Выполнить().Выгрузить();
    //ВалютаРеглУчета
	
	итТ = мТаб.Скопировать(,"Контрагент,ДетализацияПланирования,итКол,итСум,Количество,Стоимость");
	итТ.свернуть("итКол,итСум,Контрагент,ДетализацияПланирования","Количество,Стоимость");
	Для каждого итСтр из итТ Цикл
		Если итСтр.итКол <> итСтр.Количество или итСтр.итСум <> итСтр.Стоимость  Тогда
			Мас = мТаб.НайтиСтроки(Новый Структура("Контрагент,ДетализацияПланирования",итСтр.Контрагент,итСтр.ДетализацияПланирования));
			Мас[0].Количество = Мас[0].количество + итСтр.итКол - итСтр.Количество;
			Мас[0].Стоимость = Мас[0].стоимость + итСтр.итСум - итСтр.Стоимость;
		КонецЕсЛИ;
	КонецЦиклА;
	
	
	Для Каждого ТекСтрока ИЗ мТаб Цикл
		
		ТекСтрока.Стоимость = ТекСтрока.Стоимость - ?(ДокументСсылка.УчитыватьНДС И ДокументСсылка.СуммаВключаетНДС, ТекСтрока.НДС,0);
		
		ТекСтрока.Стоимость = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.Стоимость, ДокументСсылка.ВалютаДокумента,
		                            СтруктураДополнительныеСвойства.ВалютаРеглУчета, 
		                            ДокументСсылка.КурсДокумента,
		                            СтруктураДополнительныеСвойства.КурсРегл, 
		                            ДокументСсылка.КратностьДокумента,
		                            СтруктураДополнительныеСвойства.КратностьРегл);
		
		ТекСтрока.НДС = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.НДС, ДокументСсылка.ВалютаДокумента,
		                            СтруктураДополнительныеСвойства.ВалютаРеглУчета, 
		                            ДокументСсылка.КурсДокумента,
		                            СтруктураДополнительныеСвойства.КурсРегл, 
		                            ДокументСсылка.КратностьДокумента,
		                            СтруктураДополнительныеСвойства.КратностьРегл);

		Если НЕ ЗначениеЗаполнено(ТекСтрока.ДокументПланирования) Тогда
			ТекСтрока.ДокументПланирования = ДокументСсылка;
		КонецЕсли;
		
		Если ТекСтрока.ПараметрВыработки.Временный Тогда
			ТекСтрока.Количество = Цел(ТекСтрока.Количество) * 3600 + (ТекСтрока.Количество - Цел(ТекСтрока.Количество))*100*60;
		КонецЕсли;

	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПланаРаботыТС", мТаб);
		
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	
	
КонецПроцедуры
